{
    "input": "/home/leighrs/test/input/DSP_12S_samplesheet_251102_test.txt",
    "FW_primer": "GTCGGTAAAACTCGTGCCAGC",
    "RV_primer": "CATAGTGGGGTATCTAATCCCAGTTTG",
    "metadata": "/home/leighrs/test/input/DSP_12S_metadata_test.txt",
    "outdir": "/home/leighrs/test/output/",
    "seed": 13,
    "trunq": 2,
    "trunclenf":,
    "trunclenr":,
    "trunc_qmin": 25,
    "max_ee": 2,
    "sample_inference": "pooled",
    "multiple_sequencing_runs": "true",
    "min_len_asv": 150,
    "max_len_asv": 190,
    "dada_red_taxonomy":,
    "dada_ref_tax_custom": "/home/leighrs/test/RSD/12S_SFE_250811_common_names.txt",
    "skip_dada_addspecies": true,
    "dada_min_boot": 80,
    "dada_assign_taxlevels": "Kingdom,Phylum,Class,Order,Family,Genus,Species,Common",
    "exclude_taxa": "none",
    "skip_qiime": true,
    "skip_taxonomy": true,
    "skip_dada_taxonomy": true,
    "skip_phyloseq": false,
    "notes": {
        "input": "Path to the samplesheet for input sequences.",
        "input_folder": "Path to folder containing zipped FastQ files. If using this option, remove --input line",
        "FW_primer": "Forward primer sequence used for amplification.",
        "RV_primer": "Reverse primer sequence used for amplification.",
        "trunq": "Truncate each read at the first instance of a quality score less than or equal to --truncq.",
        "trunclenf": "DADA2 read truncation value for forward strand, set this to 0 for no truncation.",
        "trunclenr": "DADA2 read truncation value for reverse strand, set this to 0 for no truncation.",
        "trunc_qmin": "If --trunclenf and --trunclenr are not set, these values will be automatically determined using this median quality score.",
        "multiple_sequencing_runs": "If using --input_folder: samples were sequenced in multiple sequencing runs",
        "max_ee": "After truncation, reads with higher than max_ee will be discarded. In case of very long reads, you might want to increase this value. We recommend (to start with) a value corresponding to approximately 1 expected error per 100-200 bp.",
        "metadata": "Path to metadata file containing sample information.",
        "outdir": "Directory where output files will be saved.",
        "seed": "Random seed for reproducibility of results.",
        "sample_inference": "Method for sample inference, e.g., pooled or per-sample.",
        "min_len_asv": "Minimum length of ASVs to keep.",
        "max_len_asv": "Maximum length of ASVs to keep.",
        "dada_red_taxonomy": "gtdb, pr2, rdp, sbdi-gtdb, silva, coidb, unite-fungi, or unite-alleuk. Other options available. Check online documentation.",
        "dada_ref_tax_custom": "Path to custom reference database. Remove line if you are not using one.",
        "skip_dada_taxonomy": "If true, DADA2 taxonomy assignment will be skipped.",
        "skip_taxonomy": "If true, standard taxonomy assignment will be skipped entirely. Use this if you are BLASTing all ASVs.",
        "skip_phyloseq": "If true, phyloseq object creation will be skipped. Only raw ASV tables will be provided. If you are not assigning taxonomy here, this will be skipped anyway.",
        "skip_dada_addspecies": "If true, DADA2 will skip the additional species-level assignment step. Useful if species assignment is not needed.",
        "dada_min_boot": "Minimum bootstrap confidence threshold for DADA2 taxonomy assignment. Values below this will be considered unclassified.",
        "dada_assign_taxlevels": "Comma-separated list of taxonomic levels to assign (e.g., Kingdom, Phylum, Class, Order, Family, Genus, Species, Common). Refers to your custom database.",
        "exclude_taxa": "Taxa to exclude from the analysis. Use 'none' to keep all taxa or list specific taxa to remove.",
        "skip_qiime": "If true, Qiime steps in the pipeline will be skipped. Useful if you do not want to generate Qiime outputs.",
    }
}
